dynamic/steady/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          41;
        startFace       24493;
    }
    lower
    {
        type            wall;
        nFaces          250;
        startFace       24534;
    }
    upper
    {
        type            wall;
        nFaces          250;
        startFace       24784;
    }
    outlet
    {
        type            patch;
        nFaces          41;
        startFace       25034;
    }
    empty
    {
        type            empty;
        nFaces          24948;
        startFace       25075;
    }
    overset
    {
        type            overset;
        nFaces          168;
        startFace       50023;
    }
    cylinder
    {
        type            wall;
        nFaces          84;
        startFace       50191;
    }
    beam
    {
        type            wall;
        nFaces          76;
        startFace       50275;
    }
)

// ************************************************************************* //
