dynamic/steady/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0.1 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(lower|upper|cylinder)"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    beam
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;   //calculated;
        value           $internalField;
    }

    overset
    {
        type            overset;
    }

    empty
    {
        type            empty;
    }

}

// ************************************************************************* //
