dynamic/steady/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(lower|upper|cylinder)"
    {
        type            zeroGradient;
    }

    beam
    {
        type            zeroGradient;
    }


    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;   //calculated;
        value           $internalField;
    }

    overset
    {
        type            overset;
    }
    
    empty
    {
        type            empty;
    }

}

// ************************************************************************* //
