dynamic/steady/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(lower|upper|cylinder)"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    beam
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.01;       // 1cm - half channel height
        value           $internalField;
    }

    outlet
    {
      type            inletOutlet;
      inletValue      $internalField;
      value           $internalField;
    }

    overset
    {
        type            overset;
    }

    empty
    {
        type            empty;
    }

}

// ************************************************************************* //
