dynamic/steady/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.2;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(lower|upper|cylinder)"
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    beam
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;       // 5% turbulent intensity
        value           $internalField;
    }

    outlet
    {
      type            inletOutlet;
      inletValue      $internalField;
      value           $internalField;
    }

    overset
    {
        type            overset;
    }

    empty
    {
        type            empty;
    }

}

// ************************************************************************* //
